# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv11 Model Configuration (Light Attention)
# Only two C2PSA attention blocks kept (after P4 and before neck)

nc: 4  # number of classes

# --- Backbone (Enhanced Attention) ---
backbone:
  # [from, repeats, module, args(out_channels, kernel_size, stride, ...)]
  - [-1, 1, Conv, [64, 3, 2]]          # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 - P2 feature block
  # (Removed C2PSA after P2)

  - [-1, 1, Conv, [256, 3, 2]]         # 3 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4 - P3 feature block
  # (Removed C2PSA after P3)

  - [-1, 1, Conv, [512, 3, 2]]         # 5 - P4/16
  - [-1, 2, C3k2, [512, True]]         # 6 - P4 feature block
  - [-1, 1, C2PSA, [512]]              # 7 - Attention after P4

  - [-1, 1, Conv, [1024, 3, 2]]        # 8 - P5/32
  - [-1, 2, C3k2, [1024, True]]        # 9 - P5 feature block

  - [-1, 1, SPPF, [1024, 5]]           # 10 - Spatial Pyramid Pooling Fast
  - [-1, 2, C2PSA, [1024]]             # 11 - Final Attention before neck

# --- Head (Standard 3-Head: P3, P4, P5) ---
head:
  # --- Top-Down Path ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12 - Upsample from P5 attention output (layer 11)
  - [[-1, 7], 1, Concat, [1]]                   # 13 - Concat with P4 attention output (layer 7)
  - [-1, 2, C3k2, [512, False]]                 # 14 - Head P4 processing

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15 - Upsample from Head P4
  - [[-1, 4], 1, Concat, [1]]                   # 16 - Concat with P3 feature output (layer 4)
  - [-1, 2, C3k2, [256, False]]                 # 17 - Head P3 processing (Output P3/Small Head)

  # --- Bottom-Up Path ---
  - [-1, 1, Conv, [256, 3, 2]]                  # 18 - Downsample from Head P3 (layer 17)
  - [[-1, 14], 1, Concat, [1]]                  # 19 - Concat with Head P4 path features (layer 14)
  - [-1, 2, C3k2, [512, False]]                 # 20 - Head P4 processing (Output P4/Medium Head)

  - [-1, 1, Conv, [512, 3, 2]]                  # 21 - Downsample from Head P4 (layer 20)
  - [[-1, 11], 1, Concat, [1]]                  # 22 - Concat with P5 backbone attention output (layer 11)
  - [-1, 2, C3k2, [1024, True]]                 # 23 - Head P5 processing (Output P5/Large Head)

  # --- Detection Layer ---
  - [[17, 20, 23], 1, Detect, [nc]]             # 24 - Detect(P3_out, P4_out, P5_out)
