# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv11 Model Configuration (Medium Attention)
# Three C2PSA attention blocks: P3, P4, and before neck

nc: 4  # number of classes

# --- Backbone (Enhanced Attention) ---
backbone:
  # [from, repeats, module, args(out_channels, kernel_size, stride, ...)]
  - [-1, 1, Conv, [64, 3, 2]]      # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2 - P2 feature block
  # (No attention after P2)

  - [-1, 1, Conv, [256, 3, 2]]      # 3 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4 - P3 feature block
  - [-1, 1, C2PSA, [512]]            # 5 - *** NEW: Attention after P3 ***

  - [-1, 1, Conv, [512, 3, 2]]      # 6 - P4/16 (was 5)
  - [-1, 2, C3k2, [512, True]]       # 7 - P4 feature block (was 6)
  - [-1, 1, C2PSA, [512]]            # 8 - Attention after P4 (was 7)

  - [-1, 1, Conv, [1024, 3, 2]]     # 9 - P5/32 (was 8)
  - [-1, 2, C3k2, [1024, True]]      # 10 - P5 feature block (was 9)

  - [-1, 1, SPPF, [1024, 5]]         # 11 - Spatial Pyramid Pooling Fast (was 10)
  - [-1, 2, C2PSA, [1024]]           # 12 - Final Attention before neck (was 11)

# --- Head (Standard 3-Head: P3, P4, P5) ---
head:
  # --- Top-Down Path ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13 - Upsample from P5 attention (layer 12)
  - [[-1, 8], 1, Concat, [1]]                   # 14 - Concat with P4 attention (layer 8)
  - [-1, 2, C3k2, [512, False]]                 # 15 - Head P4 processing

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16 - Upsample from Head P4 (layer 15)
  - [[-1, 5], 1, Concat, [1]]                   # 17 - Concat with P3 attention (layer 5)
  - [-1, 2, C3k2, [256, False]]                 # 18 - Head P3 processing (Output P3/Small Head)

  # --- Bottom-Up Path ---
  - [-1, 1, Conv, [256, 3, 2]]                  # 19 - Downsample from Head P3 (layer 18)
  - [[-1, 15], 1, Concat, [1]]                  # 20 - Concat with Head P4 path (layer 15)
  - [-1, 2, C3k2, [512, False]]                 # 21 - Head P4 processing (Output P4/Medium Head)

  - [-1, 1, Conv, [512, 3, 2]]                  # 22 - Downsample from Head P4 (layer 21)
  - [[-1, 12], 1, Concat, [1]]                  # 23 - Concat with P5 backbone attention (layer 12)
  - [-1, 2, C3k2, [1024, True]]                 # 24 - Head P5 processing (Output P5/Large Head)

  # --- Detection Layer ---
  - [[18, 21, 24], 1, Detect, [nc]]             # 25 - Detect(P3_out, P4_out, P5_out)