# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv11 Model Configuration with Custom 4-Head (P2, P3, P4, P5)
# Designed for improved small object detection by adding a higher-resolution P2 head.
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# --- Parameters ---
nc: 4 # number of classes <<-- Set this to your dataset's class count
# scales: # model compound scaling constants (Commented out as we are defining a specific architecture)
#   # [depth, width, max_channels]
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512] # Default depth=1.0, width=1.0 corresponds to 'l' scale
#   x: [1.00, 1.50, 512]

# --- Backbone (Feature Extractor) ---
# Standard YOLOv11 backbone structure.
backbone:
  # [from, repeats, module, args(out_channels, kernel_size, stride, ...)]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2 (Output: 320x320 for 640 input)
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4 (Output: 160x160)
  - [-1, 2, C3k2, [256, False, 0.25]] # 2 - P2 feature processing block output

  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8 (Output: 80x80)
  - [-1, 2, C3k2, [512, False, 0.25]] # 4 - P3 feature processing block output

  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16 (Output: 40x40)
  - [-1, 2, C3k2, [512, True]]   # 6 - P4 feature processing block output

  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32 (Output: 20x20)
  - [-1, 2, C3k2, [1024, True]]  # 8 - P5 feature processing block output

  - [-1, 1, SPPF, [1024, 5]]     # 9 - Spatial Pyramid Pooling Fast (enhances context)
  - [-1, 2, C2PSA, [1024]]       # 10 - Attention mechanism before the neck

# --- Head (Feature Fusion & Detection) ---
# Modified Neck/Head structure incorporating a P2 detection layer.
head:
  # --- Top-Down Path (Fusing high-level features with low-level details) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11 - Upsample from P5 (layer 10) output
  - [[-1, 6], 1, Concat, [1]] # 12 - Concat upsampled P5 features with P4 features (layer 6)
  - [-1, 2, C3k2, [512, False]] # 13 - Process fused P4 features (Output for P4 head path)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14 - Upsample from fused P4 (layer 13)
  - [[-1, 4], 1, Concat, [1]] # 15 - Concat upsampled P4 features with P3 features (layer 4)
  - [-1, 2, C3k2, [256, False]] # 16 - Process fused P3 features (Output for P3 head path)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17 - Upsample from fused P3 (layer 16)
  - [[-1, 2], 1, Concat, [1]] # 18 - Concat upsampled P3 features with P2 features (layer 2)
  - [-1, 2, C3k2, [256, False]] # 19 - Process fused P2 features (Output P2/Tiny Head)

  # --- Bottom-Up Path (Propagating stronger low-level features upwards) ---
  - [-1, 1, Conv, [256, 3, 2]] # 20 - Downsample from P2 head output (layer 19)
  - [[-1, 16], 1, Concat, [1]] # 21 - Concat downsampled P2 with P3 path features (layer 16)
  - [-1, 2, C3k2, [512, False]] # 22 - Process fused P3 features (Output P3/Small Head)

  - [-1, 1, Conv, [512, 3, 2]] # 23 - Downsample from P3 head output (layer 22) <- Note: Conv layer has 512 channels now
  - [[-1, 13], 1, Concat, [1]] # 24 - Concat downsampled P3 with P4 path features (layer 13)
  - [-1, 2, C3k2, [512, False]] # 25 - Process fused P4 features (Output P4/Medium Head)

  - [-1, 1, Conv, [512, 3, 2]] # 26 - Downsample from P4 head output (layer 25) <- Note: Conv layer has 512 channels now
  - [[-1, 10], 1, Concat, [1]] # 27 - Concat downsampled P4 with P5 backbone features (layer 10)
  - [-1, 2, C3k2, [1024, True]] # 28 - Process fused P5 features (Output P5/Large Head)

  # --- Detection Layer ---
  # Connects the output feature maps from each scale to the detection module.
  # Order corresponds to P2, P3, P4, P5 outputs.
  - [[19, 22, 25, 28], 1, Detect, [nc]] # Detect(P2_out, P3_out, P4_out, P5_out)